[
    {
        "term": "Mug-Up",
        "definition": "The term \"Mug Up\" was used in coastal communities by the mid-1800s to describe any snack or coffee break throughout the day or evening.“Mug ups\" were an important part of life for fishermen. They would gather and have a hearty meal and warm up whenever they could take a break. Today, this nautical expression still describes a gathering of people for a drink and mealToday, Mug-up is used by Scouts Canada to describe an evening snack (after dinner, but before Campfire). It is usually soup or hot chocolate and something to munch on (grilled cheese, etc).",
        "example": "We'll meet for a mug-up with the boys when we reach harbour."
    },
    {
        "term": "Mug-Up",
        "definition": "When 2 people are kissing in a corner, typically a shady club or house party.",
        "example": "Did you see Jenn mugging up with Rob last night?"
    },
    {
        "term": "Mug-Up",
        "definition": "Usually morning coffee break. Still used on the waterfront in New England fishing towns particularly Gloucester, MA. Term was used in the movie Captains Corageous ( 1925, Spenser Tracy ) to add local flavor to this movie about the hard life of the Gloucester fishermen.",
        "example": "coffee break Mug-up"
    },
    {
        "term": "Mug-Up",
        "definition": "to get coffee.  The caffiene equivalent of \"smoke 'em if you got 'em\"",
        "example": "We'll be driving straight through, so now's your last chance to mug up."
    },
    {
        "term": "Mug-Up",
        "definition": "Showing your face/how you look “mug” also relates to “mug shot”.",
        "example": "Person A: that story you posted of yourself on instagram is readable.Person B: girl mug up then ho."
    },
    {
        "term": "Mug-Up",
        "definition": "A slang used mostly in the LGBTQ+ community when you look all cute and pretty after getting ready or after taking picture",
        "example": "“I’m all mugged up today” “Ouu I look mugged up”"
    },
    {
        "term": "Sobro",
        "definition": "Nickname referring specifically to the southwestern part of The Bronx and perpetuated by artists, which reflects the area as a burgeoning hotspot for large and affordable spaces, warehouses, etc. in which to create artwork.\r Inspired by previous areas of New York City that formerly housed nascent art communities with affordable spaces: SoHo in Manhattan (South of Houston Street) and DUMBO in Brooklyn (Down Under Manhattan Bridge Overpass).",
        "example": "Whether you're from boogie down or in the area, check out what's going down in the SoBRO galleries."
    },
    {
        "term": "Sobro",
        "definition": "A bunch of effin' animals\r comes from a section of brookline full of a bunch of kids with more DUI's than legitmate driver liscenses",
        "example": "jesus christ, i hate these sobro kids"
    },
    {
        "term": "Sobro",
        "definition": "1. The south part of brookline that borders West Roxbury. Primarily a rich community of kids that steal alcohol from Putterham Market, get with freshman girls, and have parents that pull in $5mil ever year, but the fact of the matter is that some of the five-person homes in sobro are cheaper than ones in other parts of brookline. In sobro, there is also the large, mediocre condo complex hancock village. Most of the people that live there are Koreans who are working in america for a year and want their kids to go to a good public school, but there are also many in hancock village who can't afford to live elsewhere. \rFamous spots: Putterham Market, Mandarin Gourmet, and Cheryl Ann's.\r 2. South Bronx. Totally different story.",
        "example": "1. I live in sobro, my parents make $15,000 a year, I don't drink or do drugs, and I'm a decent kid.\r 2. I live in the South Bronx, also known as Sobro."
    },
    {
        "term": "Sobro",
        "definition": "a small part of brookline, overflowing with boys that think they are invincible. they get arrested once a week and still think its cool to drink 40 beers and drive around or paddle kids. they mack the freshmen like crazy but those girls dont seem to mind. sobro thinks they own shit, but really they just start shit. the seniors of 2005 from sobro even have sobro tatoos, chill out guys. it aint cool.",
        "example": "Person 1: \"I was in sobro the other day.\"\rPerson 2: \"Did you get run over, or have beer spilled on you? Wait did dennis try to rape you?\"\rFreshman girl: \"No, he raped me. It was amaaaazing!\""
    },
    {
        "term": "Sobro",
        "definition": "Based on previous definitions, Sobro is a place only a high school student could care about or take pride in. It would appear to be occupied by a number of pretentious spoiled youth with nothing better to do than attempt to impress people on the internet.\r It's also a place where apparently a lot of people have yet to learn that in real life, no one cares where you went to high school or what town you came from. If you're lucky you'll live in a backwoods-enough place that people might \"respect\" you for you last name, but only if your rich daddy lives there too.",
        "example": "I stumbled across \"sobro\" clicking the random button, and this is what I get?"
    },
    {
        "term": "Sobro",
        "definition": "sobro is basicaly a dump filled with drunk rapests",
        "example": "im moving out of sobro"
    },
    {
        "term": "Sobro",
        "definition": "a part of the world where it is still cool have private clubs, and where everyone answers to the \"king\". sobro is a kingdom where everyone is real \"hardcore\" and you are as cool as the number of beers you can drink, but lets remind ourselves sobro does after all stand for south BROOKLINE. members of sobro wil only travel in multiples of 2 (one dick for each ass) but never less than 4 (always down for the gangbang). little girls be careful because between the incessant bumfucks within the royal family, and the paddling of little boys, they have been known to show signs of heterosexuality, but you must be below a certain height to play (dennis' bellybutton). Sobro is a place where rape is \"the coolest\" and if you have enough people backing you up, you might have the balls to cut someones plasma screen, if of course no one is looking. Sobronians are the reason people are scared to have parties, because they are convinced trashing peoples shit is badass. those of you out there ashamed of the enormous mansion your family owns or the car your rentals gave you as soon as you got your permit, sobro is a sanctuary where you can always be sure wealthy pricks will be pretending to be underprivileged in order to gain friends. Cute nicknames boys! dont talk what you havent got biiaaaach",
        "example": "whos tha hoes? kids from ...!\r one of your boys got robbed and no one did shit?"
    },
    {
        "term": "Weenie",
        "definition": "A scared person who is afraid to take chances or step out of their comfort zone. Usually, this word is used to describe a person who is afraid to go after the boy or girl that they like.",
        "example": "Ali is a weenie because she won't talk to Nicholas.\rStephanie isn't a weenie; she texted her crush last night."
    },
    {
        "term": "Weenie",
        "definition": "A penis. Usually small.",
        "example": "Hey! You have a very small weenie!"
    },
    {
        "term": "Weenie",
        "definition": "A word that little kids use instead of saying the word dick or penis",
        "example": "\"You're such a weenie!\" A 5 yr old said"
    },
    {
        "term": "Weenie",
        "definition": "The combination of a nerd and a huge baby. Puts a hault on cool things because theyre scared or worried about something dumb. Whines constantly about everything. Will probably cry when put under pressure.",
        "example": "We could have made it to that dope house show, if Sarah's boyfriend hadn't been such a WEENIE about it."
    },
    {
        "term": "Weenie",
        "definition": "Jordan brown",
        "example": "Jordan brown is a weenie head."
    },
    {
        "term": "Weenie",
        "definition": "A term used to describe a male who lacks basic male qualities or who behaves more like a female. This includes wearing tight clothing, wearing pink, lack of physical muscularity, weakness, using words such as omg, is unable to perform basic male tasks such as fixing a car or a sink, or is unable to assemble things. A weenie is also a man who overreacts in times of crisis or who is worthless during a disaster, such as an earhquake, a fire, or a hurricane.",
        "example": "I can't believe Justin can't change his car's oil!\" \"He is such a weenie."
    },
    {
        "term": "Weenie",
        "definition": "An extremely insecure person who most likely licks they balls in spare time. This person cares excessively about everything around them and tries hard for approval. He or she acts cool on the outside (or tries to) but in reality they are a true pussy at heart. A weenie needs to have a bestest friend and can never do things on his or her own. He or she has the tendency to be wrong or unjust all the time.",
        "example": "Look at that weenie-- he shits himself on the bench because he is afraid coach is gonna put him in.\r You are such a weenie..two weeks ago you said you hated rap music, and now you like it? Get a life (and live it on your own)"
    },
    {
        "term": "hmmphington",
        "definition": "(noun) a place inside you, in which you think 'i can't be arsed'.",
        "example": "\"My mind helplessly wondered into hmmphington, whilst my depression lingered.\""
    },
    {
        "term": "Newmes",
        "definition": "To spread your arms, and run around as though you are an air plane; you yell \"NEWM!\" at 'take-off', and whenever you turn.",
        "example": "<person 1> and <person 2> newmed throughout the mall. Various people gave them awkward looks."
    },
    {
        "term": "Newmes",
        "definition": "Its the sound of a fing race car newmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm.",
        "example": "Newm I am a race car"
    },
    {
        "term": "Newmes",
        "definition": "the art of annoyance, excessiveness, and belittling, in the hope of gaining positive attention from one's peers",
        "example": "Mark was really newming in front of the new girls across the hall"
    },
    {
        "term": "Newmes",
        "definition": "A term for black people that sleep alot",
        "example": "look at that newm (\"points at a black man laid down with his eyes firmly shut\")"
    },
    {
        "term": "Newmes",
        "definition": "a person who says \"wow i need to tell you something\" and then doesnt tell you",
        "example": "That kid is such an a-newms he wouldnt tell me what was going on"
    },
    {
        "term": "Newmes",
        "definition": "Originating from the phrase “new year new me”It refers to the people who go to the gym and clog up the place after New Years. Only to eventually give up on their resolution by February.",
        "example": "Look at all those Newmes going into the planet fitness"
    },
    {
        "term": "Newmes",
        "definition": "Newm means incredibly fast or to describe when one person or thing is going really fast.",
        "example": "Person 1: Look at that rabbit going NEWMMM!!"
    },
    {
        "term": "airplane ears",
        "definition": "An expression that is mostly know for cats to do when they get angry, as their ears turn sideways forming the look of the wings on an airplane",
        "example": "\"Oh no…the ginger cat has the airplane ears again…\""
    },
    {
        "term": "Wookie Plug",
        "definition": "A bundle of hair that collects in the shower drain.",
        "example": "I keep having to pick up my roommate's wookie plug every time I shower."
    }
]