[
    {
        "term": "Mug-Up",
        "description": "The term \"Mug Up\" was used in coastal communities by the mid-1800s to describe any snack or coffee break throughout the day or evening.“Mug ups\" were an important part of life for fishermen. They would gather and have a hearty meal and warm up whenever they could take a break. Today, this nautical expression still describes a gathering of people for a drink and mealToday, Mug-up is used by Scouts Canada to describe an evening snack (after dinner, but before Campfire). It is usually soup or hot chocolate and something to munch on (grilled cheese, etc)."
    },
    {
        "term": "Sobro",
        "description": "A bro that’s sober"
    },
    {
        "term": "Weenie",
        "description": "(n) An architectural concept named by Disney Imagineering describing “visual magnets” that help guests navigate and draw them from one area of a theme park to another."
    },
    {
        "term": "hmmphington",
        "description": "(noun) a place inside you, in which you think 'i can't be arsed'."
    },
    {
        "term": "Newmes",
        "description": "Originating from the phrase “new year new me”It refers to the people who go to the gym and clog up the place after New Years. Only to eventually give up on their resolution by February."
    },
    {
        "term": "airplane ears",
        "description": "An expression that is mostly know for cats to do when they get angry, as their ears turn sideways forming the look of the wings on an airplane"
    },
    {
        "term": "Wookie Plug",
        "description": "A bundle of hair that collects in the shower drain."
    },
    {
        "term": "Lasagna",
        "description": "Pasta cake."
    },
    {
        "term": "Bin Lids",
        "description": "Bin lids is cockney rhyming slang for kids."
    },
    {
        "term": "man about town",
        "description": "a fellow who can often be seen around the city... Particularly in the right places or with the right people.  Dapper, sociable, and fashionable."
    },
    {
        "term": "charlie potatoes",
        "description": "Charlie Potatoes is an old British and American slang term for a man who is on top of the world in terms of either money or popularity.  In the film \"The Defiant Ones,\" the escaped convict John \"Joker\" Jackson (Tony Curtis) fantasizes about a time when he will be rich and popular, calling himself \"Charlie Potatoes\" when he talks about it."
    },
    {
        "term": "con crud",
        "description": "Illnesses which are spread around at science fiction and furry conventions due to the large numbers of people who gather and interact in one confined place.  Lack of sleep, drama, stress, travel, and post con depression may also depress the immune system, contributing to con crud."
    },
    {
        "term": "Glomp",
        "description": "v, to glomp NOT sexual, it is the action of one person lovingly (and dramatically) attacking another with a hug.\rA glomp is often preadatory and lies somewhere in the grey area between a caring embrace, and a flying leap to tackle someone.\rThe term is used extesively in anime culture, as well as online in text form (anime because many anime characters do this often, and online because it is short and descriptive)."
    },
    {
        "term": "drop bear",
        "description": "A native to the australian outback, the drop bear is a mysterious, yet chillingly savage member of the marsupial family. If you are unlucky enough to pitch a tent under a tree inhabited by a drop bear, and rouse it from it's slumber, be prepared for pain country! It will drop from the tree, latching onto your face (a la the facehugger from the alien)and proceeds to rid you of any good looks you may (or may not) have once had.\r Only known deterrant is a generous smearing of vegemite behind the ears. It saved me once and I'd do it again in a heartbeat!"
    },
    {
        "term": "fruit salad",
        "description": "1. a mixture of household and prescription medicines (supposedly teenagers illicitly use them to become intoxicated)2. the ribbons and and badges worn with a military uniform by solders of higher ranks"
    },
    {
        "term": "thinkle",
        "description": "noun: a wrinkle that appears while a person thinks intensely"
    },
    {
        "term": "LIZ",
        "description": "LIZ or \"Low Information Zone\" refers to the distance or set of circumstances at which UFOs are recorded when the resulting eyewitness account, image or video contains insufficient information to identify them, even as non-human craft.Historically, UFOs have stayed at just the right distance so that they can't be identified. Hence, in photos or videos they appear as fuzzy blobs or points of light. Even more curiously this distance seems to vary by if the viewer has a camera, and then by the quality of the zoom lens on that camera. With better cameras and better lighting conditions, the UFOs get further away.The ability of UFOs to stay in the LIZ has led many to conclude that UFOs are mostly, or entirely, identifiable object like planes, birds, and balloons, and that the reason that UFOs are all in the LIZ is because if they were closer, or had better lighting or focus, then they would be identified and not be UFOs.The term was coined by UFO skeptic Mick West, in September 2019."
    },
    {
        "term": "Acceptional",
        "description": "ADJ. - The praise or elevation of lowered expectations.\rThe celebration of mediocrity or poor performance.\raccept / accepted + exceptional"
    },
    {
        "term": "gumshoe",
        "description": "An old slang term for a detective or investigator (police-affiliated or private). Variants include \"dick\" or \"private dick,\" the connotations of which were not meant to be obscene. \r Shoes in the late 1800s were made of gum rubber - the soft-soled precursors of the modern sneaker. The phrase \"to gumshoe\" meant to sneak around quietly as if wearing gumshoes. \r \"Gumshoe man\" was originally slang for \"thief,\" but by about 1908 the term \"gumshoe\" was used to refer to a police detective, and the term has stuck ever since (pun intended)."
    },
    {
        "term": "howdy partner",
        "description": "Hello, friend"
    },
    {
        "term": "hopecore",
        "description": "A genre of videos that invoke a feeling of hope, glee, wholeness, and most happy emotions. They can range to nostalgic clips, beautiful scenery, and usually have an audio of spliced together videos and songs."
    },
    {
        "term": "moppa",
        "description": "Informal description of a male-to-female transgendered parent (the MTF counterpart to \"mom\" or \"dad\"), derived from a combination of \"mom\" and \"poppa\". First popularized by the award-winning Amazon series \"Transparent\"."
    },
    {
        "term": "snitchuation",
        "description": "The act of getting in trouble over a snitches mouth"
    },
    {
        "term": "Incelligence",
        "description": "noun1. the ability to acquire, and apply, knowledge and/or skills that only an incel would value.\r2. the actual information itself, again only of interest to guys who are socially awkward and bad at dating."
    },
    {
        "term": "Severance Lay",
        "description": "When, after ending a relationship, you have sex for the last time; either after they break up with you, or you with them."
    },
    {
        "term": "Cutie patootie",
        "description": "you. you are a cutie patootie"
    },
    {
        "term": "let them eat cake",
        "description": "A quote attributed to Marie Antoinette, who allegedly spoke it in regard to her peasants having no bread to eat. Regardless of whether that actually happened, it is still the snobbiest way of saying \"fuck them and what they want.\""
    },
    {
        "term": "shock and aww",
        "description": "When you encounter something very cute and “aww worthy,” to the point of it destabilizing you and pulverizing a few brain cells.From “shock and awe,” a military strategy that involves using overwhelming force and firepower to quickly gain dominance over an adversary.Shock and aww is used by social media platforms to keep people hooked"
    },
    {
        "term": "Sniffari",
        "description": "Combination of the words \"sniff\" and \"safari\". It occurs when your dog wants to take up the entire day to sniff every blade of grass in the neighborhood on their walk."
    },
    {
        "term": "loml",
        "description": "Acronym for love of my life. A soulmate. Pronounced \"Lom-El\" Is also referred to as OTLOML which stands for One True Love Of My Life."
    },
    {
        "term": "brain lint",
        "description": "Information that serves no purpose and consumes valuable space in your head."
    },
    {
        "term": "Y'allywood",
        "description": "The burgeoning film industry in Georgia. Because of state tax incentives, more production companies are moving shoot locations from traditional (but expensive) locations like Hollywood and New York in order to save money."
    },
    {
        "term": "business socks",
        "description": "The socks you where when its business time, popularized by Flight of the Conchords."
    },
    {
        "term": "wazzock",
        "description": "Popularised by Tony Capstick (in \"Capstick Comes Home\") in 1981 and used since as a minor insult (similar to how \"idiot\" is used as an insult).\r Originally meant \"bull's penis\" (originally described to me as \"bull's prick\").  See also \"wazz\" for another derivative of this sense of the word.  Whether it was ever applied to other animals or humans I don't know - but as \"wazz\" is used for human urination in the West and North of England, I'd imagine so.\r Was fairly rare in Yorkshire before Capstick's popularisation of it in 1981."
    },
    {
        "term": "Aunty",
        "description": "In some other countries, they are used as nice, more loving words to address closely related older women."
    },
    {
        "term": "dining room table",
        "description": "Someone who cannot be reasoned with, especially when confronted with the facts."
    },
    {
        "term": "Holding Space",
        "description": "Typically used in queer media, Holding space is used when you feel power in something and really need to hold space with that."
    },
    {
        "term": "pseud",
        "description": "(noun) |Plural: pseuds|\rA pretentious person that pretends to know a lot about the Arts when infact knows very little or nothing. \r Shortening of the word: Pseudo  Pronounced: \"Su'youd\""
    },
    {
        "term": "Tiger Stripes",
        "description": "stretch marks on the skin, which resemble the stripes on a tiger"
    },
    {
        "term": "vanifesto",
        "description": "A van covered in political stickers and other propaganda reflecting the owner’s political beliefs. Usually driven by a right-wing nut job."
    },
    {
        "term": "homieship",
        "description": "The state of friendship between homies."
    },
    {
        "term": "Small Potatoes",
        "description": "small, insignificant; small or insignificant in quantity\r comes from the Irish potatoe famine from 1845 - 1849, as potatoes was the main food source in Ireland. Used to describe the small surviving potatoes that were picked"
    },
    {
        "term": "Butt Rock",
        "description": "A style of hard rock & heavy metal music that is watered down both musically and lyrically to garner maximum radio play and mainstream acceptance. Lyrical themes are drawn from a put-on “tough guy / bro” persona, and include being a badass, getting lots of pussy, strippers, partying, and being betrayed or alone. Image wise, butt rock bands typically consist of guys in their mid-30s with spiky hair, Affliction t-shirts, and bad tattoos (usually barbed wire or tribal). The typical fan emulates this fashion style and exhibits what they think are “manly” personality traits, such as frequently drinking energy drinks, driving an unnecessarily large truck, and otherwise overcompensating for an insecurity in their masculinity. They also tend to have a superficial knowledge of metal music, being familiar only with bands that receive regular radio rotation. Examples of butt rock bands include Five Finger Death Punch, Three Days Grace, Buckcherry, Nickelback, Disturbed, and Three Doors Down."
    },
    {
        "term": "Cardboard Salesman",
        "description": "A cardboard salesman is like a snake oil salesman but of the modern era. Stupid ass products they sell may be things that you don't even need, like quesadilla makers or scams like a $30 laptop online"
    },
    {
        "term": "bedcrack",
        "description": "The space between one’s bed and the wall. Anything that falls in here mysteriously disappears."
    },
    {
        "term": "Sneaker Head",
        "description": "The exact same thing as a crack head but instead of crack it’s sneakers"
    },
    {
        "term": "Sigogglin",
        "description": "si-gogglin Adj.Not built correctly, crooked, skewed, out of balance.This term is common in the Appalachian region of North America.See also cattywompus"
    },
    {
        "term": "chemosabe",
        "description": "A trusted friend and confidant who is also undergoing cancer-treatment."
    },
    {
        "term": "kakistocracy",
        "description": "\"government by the least qualified, most stupid members\""
    },
    {
        "term": "Depresso Espresso",
        "description": "A fun way to say depression"
    },
    {
        "term": "tastemaker",
        "description": "N., \"a person whose judgments about what is good, fashionable, etc., are accepted and followed by many other people\", i.e., an asshole."
    },
    {
        "term": "hangry",
        "description": "When someone becomes irritated, angry, or cranky when they haven't eaten and are hungry."
    },
    {
        "term": "hesher",
        "description": "Hesher can be generally described as a grungy, long-haired person with a \"still stuck in the '80s\" image. Usually seen wearing leather motorcycle or denim jacket full of band patches, torn acid-washed jeans and an '80s rock t-shirt.Likes to listen to some heavy metal tunes while riding an old school van. Charactirized by an outlaw attitude, probably drinks alcohol and smokes weed. Similar in appearance to a thrasher."
    },
    {
        "term": "BLOBJECT",
        "description": "BLOBJECT  Designed object styled by an expired trend of morally turpid purpose. FORM-OVER-FUNCTION-and-PURPOSE. Endemic if not emblematic of the Bush/Chenney era of 'Bubble' economies and baseless wars. This style came about without deep reazoning, solely because it could by way of technology. Conceived under the false and misguided precept that \"design could bring stories to life\".\r Characterized by the advent of faster rendering and 3D applications which allowed to execute visions of the 50's modernity, except with out the inherent reasoning that makes timeless useful classics and trully beautiful objects. Like a bubble, this style has gone bust.\r Blobject also invokes the bloated state of our environment whence humans keep on gorging on superficially conceived stuff and piling that useless stuff on top of useless stuff. Blobjects upon blobjects.."
    },
    {
        "term": "sweetie wife",
        "description": "Scottish word.......Sweetie-wife: n. purveyor of gossip. A man who likes to gossip. A man who is in the affairs of women."
    },
    {
        "term": "Screaming Barfies",
        "description": "A term used mostly by ice climbers to describe the feeling of having your hands go numb only to come back to feeling with extreme pain.  The terminology coming from when your hands are coming back to feeling you want to scream and barf at the same time."
    },
    {
        "term": "Oh Brother",
        "description": "Winnie the Poohs equivalent to \"Mother Fucking Shit\""
    },
    {
        "term": "Sanctuary",
        "description": "This is sanctuary from the evil of this dictionary. You may use it as you like."
    },
    {
        "term": "Self care",
        "description": "Doing acid and yelling at the moon naked"
    },
    {
        "term": "Squinny",
        "description": "Chipmunk: word used in Des Moines area"
    },
    {
        "term": "Deadhead",
        "description": "A hardcore fan of the Grateful Dead. The complete opposite of a Parrothead."
    },
    {
        "term": "post yap clarity",
        "description": "A feeling a person may feel after yapping for too long that is the combined sentiment of disappointment, cringe, self consciousness, and general uneasiness."
    },
    {
        "term": "wifesexual",
        "description": "when you are only attracted to your wife and when you will only ever be attracted to your beautiful wife."
    },
    {
        "term": "Making Chocolate Pudding At 4am",
        "description": "Losing complete control of your life"
    },
    {
        "term": "grinch finger",
        "description": "1. an extremely giant potent bud of marijuina resembling the Grinch's finger\r 2. an over sized conglomerate of a single bud of marijuina"
    },
    {
        "term": "I just think it's funny how",
        "description": "A low key but passive aggressive way to tell someone your angry with them"
    },
    {
        "term": "fart in a trance",
        "description": "Someone who acts slow or drowsy, and generally seems disconnected from reality or 'out of it'."
    },
    {
        "term": "Scrubber",
        "description": "(Fragrance Reference)\rA perfume or cologne that's offensive/unbearable, generally a failed blind buy. A bust. A fragrance that you want to wash off immediately."
    },
    {
        "term": "swoop and squat",
        "description": "Such an operation typically involves two cars driven by suspects who box in a victim’s car on a freeway, causing a collision. The scam participants then file fraudulent insurance claims for alleged injuries."
    },
    {
        "term": "Echo Bunker",
        "description": "An echo chamber so tightly sealed that no amount of truth can seep in."
    }
]